
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_PORT
* Replace
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-host/164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ name                    = "postgresdb-host" -> "api-POSTGRES-HOST" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-host/versions/164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-host" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "164633b4779747748f55bb6cf513c7cb" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-host" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PASS must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-password/5c0d74ee92434f359af4a44f9b9bf668" -> (known after apply)
      ~ name                    = "postgresdb-password" -> "api-POSTGRES-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password/versions/5c0d74ee92434f359af4a44f9b9bf668" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "5c0d74ee92434f359af4a44f9b9bf668" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_USER must be replaced
-/+ resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      ~ id                      = "https://pre-stg.vault.azure.net/secrets/postgresdb-username/3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ name                    = "postgresdb-username" -> "api-POSTGRES-USER" # forces replacement
      ~ resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username/versions/3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/postgresdb-username" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "3b8ba020342b4e9abce5ea785b00496a" -> (known after apply)
      ~ versionless_id          = "https://pre-stg.vault.azure.net/secrets/postgresdb-username" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":658,"Program":"tfcmt","SHA1":"","Vars":{}} -->